my-programmer-dvorak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Switched to USA Pragrammer Dvorak Keyboard</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Switched to USA Pragrammer Dvorak Keyboard"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-09-29"/>
<meta name="author" content="Bao Haojun"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/default.css" type="text/css">
 <link rel="shortcut icon" href="/poison.png" type="image/png" />


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Switched to USA Pragrammer Dvorak Keyboard</h1>

<p>After reading <a href="http://xahlee.org/index.html">xahlee</a>'s articles on keyboards, I recently made 2 big
changes (and many other small changes because of the 2 big ones) to
the way I type. I switched from QWERTY to UPD (USA Programmer Dvorak),
and I switched my Control keys and Alt keys.
</p>
<p>
And how does it feel? Well, at first it was like pain in the ass. But
then it seems to get better and better.
</p>
<p>
And to make it even better, I bought a Microsoft Ergonomics 4000
keyboard for use at work!
</p>
<p>
Here's some hacking around this switch.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Switching Chinese and English at the same time</a></li>
<li><a href="#sec-2">2 Some changes to Emacs</a></li>
<li><a href="#sec-3">3 Using Progammers Dvorak under Windows.</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-3">
<h3 id="sec-1"><span class="section-number-3">1</span> Switching Chinese and English at the same time</h3>
<div class="outline-text-3" id="text-1">


<p>
As a Chinese, I also need to type Chinese using an Input Method, such
as Wubi. Now, I want myself to use the same UDP keyboard layout when
using IME, because it would be crazy if I switch back to QWERTY when
typing Chinese and stick to UDP when typing English&hellip;
</p>
<p>
But switching to UDP for my IME is even more painful. Because I am
using Wubi, instead of PinYin, and the secret about Wubi is you use
your muscle to memorize the encoding, so basically I just re-learned
Wubi. 
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2"><span class="section-number-3">2</span> Some changes to Emacs</h3>
<div class="outline-text-3" id="text-2">


<p>
Xahlee considered Progammers Dvorak no better than Simple Dvorak (he
tried UDP and then gave up), but I chose it anyway and have no plan to
change again. I kinda feel its not that a bigger differenc now that
both are Dvorak&hellip;
</p>
<p>
But Progammers Dvorak does give me some edge, considering the fact
that I also switched Controls and Alts (which is also one of the
advices by Xahlee).
</p>
<p>
This made a lot trouble with C-x and M-x. In the mean time, C-x got
separated with many of the combination keys that used to be typed with
the same hand as itself: C-x C-s, C-x C-f, etc.
</p>
<p>
Finally I found my solution (after searching Dvorak on EmacsWiki and
some inspiration): 
</p>
<ol>
<li>Switch C-h and C-x using keyboard-translate.

</li>
<li>Stop using M- prefix altogether, use C-[ (the same effect as ESC)
   instead. Now Progammers Dvorak seem a much better choice than Simle
   Dvorak, because C-[ is very easy to type.
</li>
</ol>


<p>
I tried to add more hacks, but finally stopped to reduce the
confusion, and because the above 2 is about enough.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3"><span class="section-number-3">3</span> Using Progammers Dvorak under Windows.</h3>
<div class="outline-text-3" id="text-3">


<p>
Not that I use Windows a lot nowadays, but I do use it once in a
little while, and I don't want to be a fool when at it. So I need to
find a way to use Progammers Dvorak under Windows. 
</p>
<p>
Windows already provide a Simple Dvorak keyboad layout, and Programms
Dvorak also available on the net. But they are both incompitable with
IME. 
</p>
<p>
I found on the net people has used autohotkey to provide Simple
Dvorak, which does can be used at the same time with IME.
</p>
<p>
So I just wrote my Programms Dvorak version of autohotkey script. You
can get it <a href="http://github.com/baohaojun/windows-config/raw/master/doc/dvorak.ahk">here</a>. This ahk script was generated from 3 bash scripts,
which you can find <a href="http://github.com/baohaojun/windows-config/raw/master/doc/dvorak.ahk.in">here</a>, <a href="http://github.com/baohaojun/windows-config/raw/master/bin/gen-dvorak-programmer.sh">here</a> and <a href="http://github.com/baohaojun/windows-config/raw/master/bin/gen-dvorak-programmer-shift3.sh">here</a>.
</p></div>
</div>
</div>

<div id="postamble">
    <hr/>
    <div style="float:left;width:160px;">
    <iframe width="100%" height="75" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=0&noborder=0&isWeibo=0&isFans=0&uid=1611427581&verifier=936f3b91&dpc=1"></iframe>
    </div>
    <div id="jiathis_style_32x32" style="float:left;margin-left:20px;margin-top:35px;">
        <a class="jiathis_button_tsina"></a>
        <a class="jiathis_button_douban"></a>
        <a class="jiathis_button_tqq"></a>
        <a class="jiathis_button_renren"></a>
        <a class="jiathis_button_douban9dian"></a>
        <!--<a class="jiathis_button_readitlater"></a>-->
        <!--<a class="jiathis_button_instapaper"></a>-->
        <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
        <!--<a class="jiathis_counter_style"></a>-->
    </div>
<script type="text/javascript">
    $(document).ready(function(){
        BYB.includeScript('http://v2.jiathis.com/code/jia.js',function(){})
    });
</script>


</div>
</body>
</html>
